# HasLining Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..HasLining Property
FabricationPart Class See Also
---
True if the fabrication part is lined.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool HasLining { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HasLining As Boolean
	Get
```

Visual C++
---
```text
public:
property bool HasLining {
	bool get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace